cars-backend/app/controllers/cars_controller.rb

  def index
    cars = Car.all
---
SELECT "cars".* FROM "cars"

  def set_car
    @car = Car.find_by_id(params[:id])
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]